cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'pivotal/tap'
tap 'universal-ctags/universal-ctags'

brew 'ack'
brew 'autoconf'
brew 'base64'
brew 'dos2unix'
brew 'automake'
brew 'direnv'
brew 'pcre'
brew 'ccze'
brew 'coreutils'
brew 'ctags'
brew 'gdbm'
brew 'ghi'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'godep'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'pkg-config'
brew 'openssl'
brew 'libevent'
brew 'libgpg-error'
brew 'libksba'
brew 'libtool'
brew 'libyaml'
brew 'nvm'
brew 'readline'
brew 'python3'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'screenfetch'
brew 'shellcheck'
brew 'tmux'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'yank'
brew 'zsh'
brew 'cloudfoundry/tap/cf-cli'
cask 'iterm2'
cask 'adoptopenjdk8'
brew 'gradle'
cask 'visual-studio-code'
cask 'postman'
cask 'datagrip'
brew 'maven'
cask 'flycut'
cask 'cyberduck'
brew 'thefuck'
cask 'pock'
brew 'the_silver_searcher'
brew 'hugo'
brew 'weechat'
cask 'google-cloud-sdk'
brew 'kubectl'
brew 'fluxctl'
